app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams"
---
  def index
    @teams = Team.all

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @team = Team.find(params[:id])

INSERT INTO "teams" ("name", "sport", "number_required_to_play", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Fuckin' Seagulls"], ["sport", "Basketball"], ["number_required_to_play", 5], ["created_at", "2017-08-31 17:22:38.091493"], ["updated_at", "2017-08-31 17:22:38.091493"]]
---
  def create
    @team = Team.new(team_params)

    if @team.save

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "teams" WHERE "teams"."id" = $1  [["id", 1]]
---
  def destroy
    @team = Team.find(params[:id])
    @team.destroy